export enum VaccineType {
  /** วัคซีนกำจัดเห็บหมัด */
  FLEA_TICK = 'วัคซีนกำจัดเห็บหมัด',

  /** วัคซีนป้องกันโรคพิษสุนัขบ้า (เรบีส์) */
  RABIES = 'วัคซีนป้องกันโรคพิษสุนัขบ้า (เรบีส์)',

  /** วัคซีนป้องกันโรคไข้หัดสุนัข */
  DISTEMPER = 'วัคซีนป้องกันโรคไข้หัดสุนัข',

  /** วัคซีนป้องกันโรคตับอักเสบ */
  HEPATITIS = 'วัคซีนป้องกันโรคตับอักเสบ',

  /** วัคซีนป้องกันโรคไข้ฉี่หนู */
  LEPTOSPIROSIS = 'วัคซีนป้องกันโรคไข้ฉี่หนู',

  /** วัคซีนป้องกันเชื้อพาร์โวไวรัส */
  PARVOVIRUS = 'วัคซีนป้องกันเชื้อพาร์โวไวรัส',

  /** วัคซีนรวม 5 โรค */
  COMBINED_5 = 'วัคซีนรวม 5 โรค',
}
